---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetSet
source: html/1acdcf0f-0a0e-5734-9bc2-509ca3b8389d.htm
---
# AssetSet Methods

Causes the object to release immediately any resources it may be utilizing.